#include "Aimbot.h"
#include "../Esp/Visuals.h"
#include "../Settings/Settings.hpp"
#include "../RustHooks/ClientInput/Manipulation.h"

inline bool is_melee = false;

//struct BulletDropPredictionData
//{
//	float distCoeff;
//	float startY;
//	float yCoeff;
//};
//
//BulletDropPredictionData bulletDropData[11];
//
//#define M_PI 3.14159265358979323846f
//#define M_PI_F ((float)(M_PI))
//#define DEG2RAD(val) ((float)(val) * (float)(M_PI_F / 180.0f))
//#define RAD2DEG(val) ((float)(val) * (float)(180.0f / M_PI_F))
//
//Vector3 GetEndPointForTrajectory(float speed, float angle, float drag, float gravityMod)
//{
//	float pitchRad = DEG2RAD(angle);
//
//	Vector3 dir = {
//		(float)(win32::sinf(90.f) * win32::cosf(pitchRad)),
//		(float)win32::sinf(pitchRad),
//		(float)(win32::cosf(90.f) * win32::cosf(pitchRad))
//	};
//
//	Vector3 position = Vector3();
//	Vector3 velCheck = dir * speed;
//
//	const float stepSize = 0.03125f;
//
//	for (float travelTime = 0.f; travelTime < 8.f; travelTime += stepSize)
//	{
//		position += velCheck * stepSize;
//		velCheck.y -= 9.81f * gravityMod * stepSize;
//		velCheck -= velCheck * drag * stepSize;
//	}
//
//	return position;
//}
//
//void GenerateBuilletDropPredictionData(float drag, float gravityMod)
//{
//	int currentIndex = 0;
//	for (float angle = 35.f; angle <= 85.f; angle += 5.f)
//	{
//		BulletDropPredictionData& predData = bulletDropData[currentIndex++];
//
//		Vector3 a1 = GetEndPointForTrajectory(30.f, angle, drag, gravityMod);

//		predData.distCoeff = a2.Length2D() / 50.f;
//		predData.startY = a1.y;
//		predData.yCoeff = (a2.y - a1.y) / 20.f;
//	}
//}
//
//inline Vector2 CalcAngle(const Vector3& Src, const Vector3& Dst)
//{
//	Vector3 dir = Src - Dst;
//	return Vector2{ RAD2DEG(win32::asin(dir.y / dir.Length())), RAD2DEG(-win32::atan2(dir.x, -dir.z)) };
//}
//
//auto cameraPos = UnityEngine::Camera::get_main()->get_positionz();
//auto AimbotTarget = AssemblyCSharp::BasePlayer::GetTarget(cameraPos, 500.f);
//
//Vector2 angle = CalcAngle(cameraPos, AimbotTarget.m_player->get_bone_transform(47)->get_position());
//
//float yRad = DEG2RAD(angle.y);
//
//int currentIndex = 0;


namespace O::Projectile {
	constexpr auto initialVelocity = 0x18;
	constexpr auto drag = 0x24;
	constexpr auto gravityModifier = 0x28;
	constexpr auto thickness = 0x2C;
	constexpr auto initialDistance = 0x30;
	constexpr auto remainInWorld = 0x34;
	constexpr auto stickProbability = 0x38;
	constexpr auto breakProbability = 0x3C;
	constexpr auto conditionLoss = 0x40;
	constexpr auto ricochetChance = 0x44;
	constexpr auto penetrationPower = 0x48;
	constexpr auto waterIntegrityLoss = 0x4C;
	constexpr auto damageProperties = 0x50;
	constexpr auto damageDistances = 0x58;
	constexpr auto createDecals = 0x80;
	constexpr auto doDefaultHitEffects = 0x81;
	constexpr auto flybySound = 0x88;
	constexpr auto flybySoundDistance = 0x90;
	constexpr auto closeFlybySound = 0x98;
	constexpr auto closeFlybyDistance = 0xA0;
	constexpr auto tumbleSpeed = 0xA4;
	constexpr auto tumbleAxis = 0xA8;
	constexpr auto swimScale = 0xB4;
	constexpr auto swimSpeed = 0xC0;
	constexpr auto owner = 0xD0;
	constexpr auto sourceWeaponPrefab = 0xD8;
	constexpr auto sourceProjectilePrefab = 0xE0;
	constexpr auto mod = 0xE8;
	constexpr auto projectileID = 0xF0;
	constexpr auto seed = 0xF4;
	constexpr auto clientsideEffect = 0xF8;
	constexpr auto clientsideAttack = 0xF9;
	constexpr auto integrity = 0xFC;
	constexpr auto maxDistance = 0x100;
	constexpr auto modifier = 0x104;
	constexpr auto invisible = 0x114;
	constexpr auto currentVelocity = 0x118;
	constexpr auto currentPosition = 0x124;
	constexpr auto traveledDistance = 0x130;
	constexpr auto traveledTime = 0x134;
	constexpr auto launchTime = 0x138;
	constexpr auto sentPosition = 0x13C;
	constexpr auto previousPosition = 0x148;
	constexpr auto previousVelocity = 0x154;
	constexpr auto previousTraveledTime = 0x160;
	constexpr auto isUnderwater = 0x164;
	constexpr auto isRicochet = 0x165;
	constexpr auto isRetiring = 0x166;
	constexpr auto flybyPlayed = 0x167;
	constexpr auto wasFacingPlayer = 0x168;
	constexpr auto flybyPlane = 0x16C;
	constexpr auto flybyRay = 0x17C;
	constexpr auto cleanupAction = 0x198;
	constexpr auto hitTest = 0x1A0;
	constexpr auto swimRandom = 0x1A8;
	constexpr auto _waterMaterialID = 0x4;
	constexpr auto cachedWaterString = 0x8;
};
#define safe_read(Addr, Type) memory::Read<Type>((DWORD64)Addr)
#define safe_write(Addr, Data, Type) memory::Write<Type>((DWORD64)Addr, Data);

class Projectile_c : AssemblyCSharp::Projectile {
public:
	IL2CPP_CLASS("Projectile");
	IL2CPP_FIELD(float, thickness);
	IL2CPP_FIELD(Vector3, currentPosition);
	IL2CPP_FIELD(Vector3, sentPosition);

	IL2CPP_FIELD(Vector3, currentVelocity);
	IL2CPP_FIELD(Vector3, initialVelocity);
	IL2CPP_FIELD(Vector3, previousPosition);
	IL2CPP_FIELD(Vector3, previousVelocity);
	IL2CPP_FIELD(AssemblyCSharp::HitTest*, hitTest);
	IL2CPP_FIELD(float, traveledTime);
	IL2CPP_FIELD(float, traveledDistance);
	IL2CPP_FIELD(float, gravityModifier);
	IL2CPP_FIELD(float, drag);
	IL2CPP_FIELD(float, closeFlybyDistance);
	IL2CPP_FIELD(float, tumbleSpeed);
	IL2CPP_FIELD(float, maxDistance);
	IL2CPP_FIELD(bool, createDecals);
	IL2CPP_FIELD(Vector3, tumbleAxis);
	IL2CPP_FIELD(float, previousTraveledTime);
	IL2CPP_FIELD(float, launchTime);
	IL2CPP_FIELD(Vector3, swimScale);
	IL2CPP_FIELD(float, penetrationPower);
	IL2CPP_FIELD(int, seed);
	IL2CPP_FIELD(float, flybySoundDistance);

	IL2CPP_FIELD(int, projectileID);
	//IL2CPP_FIELD(ItemModProjectile*, mod);
	IL2CPP_FIELD(float, initialDistance);
	//IL2CPP_FIELD(ItemModProjectile*, mod);
	IL2CPP_FIELD(float, integrity);
	IL2CPP_FIELD(AssemblyCSharp::BasePlayer*, owner);
	IL2CPP_FIELD(bool, isRicochet);
	IL2CPP_FIELD(AssemblyCSharp::AttackEntity*, sourceWeaponPrefab);
	IL2CPP_FIELD(AssemblyCSharp::DamageProperties*, damageProperties);
	IL2CPP_FIELD(float, ricochetChance);

	bool IsAlive() {
		return (this->integrity() > 0.001f && this->traveledDistance() < this->maxDistance() && this->traveledTime() < 8);
	}

	struct TraceInfo {

		bool valid; // 0x0
		float distance; // 0x4
		DWORD64 entity; // 0x8  
		Vector3 point; // 0x10
		Vector3 normal; // 0x1C
		DWORD64/*Transform*/ bone; // 0x28
		DWORD64 material; // 0x30
		unsigned int partID; // 0x38
		DWORD64 collider; // 0x40
	};
	inline Vector3 SimulateProjectilezzzzz(Vector3& position, Vector3& velocity, float& partialTime, float travelTime, Vector3 gravity, float drag)
	{
		float num = 0.03125f;
		Vector3 origin = position;
		if (partialTime > 0)
		{
			float num2 = num - partialTime;
			if (travelTime < num2)
			{
				origin = position;
				position += velocity * travelTime;
				partialTime += travelTime;
				return origin;
			}
			origin = position;
			position += velocity * num2;
			velocity += gravity * num;
			velocity -= velocity * drag * num;
			travelTime -= num2;
		}

		int num3 = int(travelTime / num);

		for (int i = 0; i < num3; i++)
		{
			origin = position;
			position += velocity * num;
			velocity += gravity * num;
			velocity -= velocity * drag * num;
		}
		partialTime = travelTime - num * (float)num3;
		if (partialTime > 0)
		{
			origin = position;
			position += velocity * partialTime;
		}
		return origin;
	}

